import numpy as np

avg_dhour = [[], [], [], []]  # 0部门，1部门平均时长，2平均上班时间，3平均下班时间
avg_dhour1 = [[], [], [], []]  # 0部门，1部门平均时长，2平均上班时间，3平均下班时间
avg_dhour = [['安全保卫', '办公室', '财务会计部', '对公业务委员会', '风险管理部', '个人金融部（私人银行部，乡村振兴金融部）', '公司业务部（资金结算业务部）', '国际业务部', '机构业务部',
              '金融科技部（产品创新与管理部）', '内控合规部', '普惠金融事业部（小企业业务部）', '渠道管理部（消费者权益保护部）', '人力资源部', '私人银行经营中心', '投行与金融市场业务经营中心',
              '网络金融业务中心', '行领导', '营运中心', '住房金融业务部', '驻宁纪检组', '资产保全经营中心', '总务'],
             [14.97, 15.12, 11.38, 16.99, 12.49, 13.86, 13.97, 14.87, 10.14, 11.93, 13.08, 12.41, 13.62, 14.63, 14.33,
              12.09, 10.37, 16.42, 12.72, 11.96, 13.23, 12.32, 12.14],
             [4.13, 4.19, 6.07, 3.33, 3.57, 3.56, 4.43, 4.06, 7.29, 4.09, 3.49, 5.34, 4.33, 4.43, 3.51, 4.06, 7.31,
              1.57, 1.29, 3.54, 3.54, 4.06, 3.45],
             [19.1, 19.26, 17.3, 17.08, 13.57, 17.47, 18.41, 18.58, 17.37, 13.41, 14.17, 17.58, 18.11, 19.21, 15.18,
              13.46, 17.53, 11.48, 6.34, 13.28, 14.29, 13.58, 13.28]]
mid = np.array(avg_dhour[1])
print(mid)
mid = np.argsort(mid)
print(mid)
# print(avg_dhour[mid])
# print(avg_dhour)
# print(avg_dhour1)
